//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------//
// 0.0.1
// Alexey Potehin <gnuplanet@gmail.com>, http://www.gnuplanet.ru/doc/cv
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------//
#include <stdio.h>
#include <string>
#include "libxlwriter.hpp"
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------//
/**
 * \file   test.cpp
 * \Author gnuplanet@gmail.com
 * \brief  Демонстрирует функциональность библиотеки
 * \return код возврата
 */
int main(int argc, char *argv[])
{
	if (argc == 1)
	{
		printf("example: %s OUTPUT_FILE\n", argv[0]);
		return 1;
	}


	std::string error_str;
	libxlwriter_t libxlwriter;


	libxlwriter_sheet_t sheet("list", 2, 3);

	sheet.set_col(0, libxlwriter_sheet_t::DateTime, "Дата");
	sheet.set_col(1, libxlwriter_sheet_t::Number,   "Поступило");
	sheet.set_col(2, libxlwriter_sheet_t::String,   "Назначение платежа");

	sheet.set(0, 0, "2014-04-09T00:00:00.000");
	sheet.set(0, 1, "10000");
	sheet.set(0, 2, "Инкассация за 2014-04-09г. препроводительная ведомость 137/");

	sheet.set(1, 0, "2014-04-09T00:00:00.000");
	sheet.set(1, 1, "10000");
	sheet.set(1, 2, "Инкассация за 2014-04-09г. препроводительная ведомость 137/");

	libxlwriter.add_sheet(sheet);


	if (libxlwriter.write(argv[1], true) == false)
	{
		libxlwriter.get_error_str(error_str);
		printf("ERROR[xlwriter.write()]: %s\n", error_str.c_str());
		return 1;
	}


	return 0;
}
//-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------//
